Tekla Open API Reference for Tekla Structures 2025
Reinforcement.GetNumberOfRebars Method
 Returns the number of rebars in the reinforcing group.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int GetNumberOfRebars()
Public Function GetNumberOfRebars As Integer
Return Value
Type: Int32
The number of rebars in the rebar group.
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace